БИТУправление_медицинским_центром_демо/src/Catalogs/СтандартыЛечения/СтандартыЛечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтандартыЛечения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайлаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтандарта</name>
    <comment>Истина - регламентированный, Ложь - внутренний</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОфициальное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегламентированногоСтандарта</name>
    <comment>1 - Первичная медико-санитарная помощь, 2 - Специализированная медицинская помощь</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолПациента</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастнаяКатегория</name>
    <type>
      <types>EnumRef.ВозрастныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>СтадияЗаболевания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименованиеСтандарта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначения</name>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.СправочникМеждународныхНепатентованныхНаименований</types>
        <types>CatalogRef.Номенклатура</types>
        <types>String</types>
        <types>CatalogRef.КатегорииВыработки</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНазначения</name>
      <type>
        <types>EnumRef.ВидыНазначений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеОтДатыПриема</name>
      <comment>Смещение даты назначения в днях относительно даты документа &quot;Прием&quot;, в котором выбран данный шаблон плана лечения.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодставитьВрачаИзПриема</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторНазначения</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>РазоваяДоза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемовВДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураМедицинскихУслуг</name>
      <type>
        <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Частота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыНазначений/ВидыНазначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНазначений</name>
  <enumValues>
    <name>Обследование</name>
  </enumValues>
  <enumValues>
    <name>Процедура</name>
  </enumValues>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Медикаменты</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/СтандартыЛечения/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Для Каждого СтрокаНазначение Из ЭтотОбъект.Назначения Цикл 
		Если Не ЗначениеЗаполнено(СтрокаНазначение.ВидНазначения) Тогда 
			СтрокаНазначение.ВидНазначения = Перечисления.ВидыНазначений.Процедура;
		КонецЕсли;
	КонецЦикла;
	
	Если Не (ЭтотОбъект.ЭтоГруппа Или ЭтотОбъект.ВидСтандарта) Тогда
		Для Каждого Назначение Из ЭтотОбъект.Назначения Цикл
			Назначение.НоменклатураМедицинскихУслуг = Справочники.НоменклатураМедицинскихУслуг.ПустаяСсылка();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ДатаОбновления = Дата(1,1,1);
	
КонецПроцедуры

#КонецОбласти
